[
  {
    "code": 0,
    "type": "Course sur route",
    "description": "Courses organisées sur routes goudronnées, ouvertes au grand public."
  },
  {
    "code": 1,
    "type": "Trail",
    "description": "Courses sur sentiers naturels, souvent en forêt ou en montagne."
  },
  {
    "code": 2,
    "type": "Ultra-trail",
    "description": "Trails de très longue distance, souvent supérieurs à 50 km."
  },
  {
    "code": 3,
    "type": "Marathon",
    "description": "Course sur route de 42,195 km, ouverte aux amateurs et professionnels."
  },
  {
    "code": 4,
    "type": "Semi-marathon",
    "description": "Course sur route de 21,1 km, populaire pour les coureurs de moyenne distance."
  },
  {
    "code": 5,
    "type": "10 km",
    "description": "Course sur route de 10 kilomètres, accessible à tous."
  },
  {
    "code": 6,
    "type": "5 km",
    "description": "Course courte sur route, souvent organisée comme course de loisir ou caritative."
  },
  {
    "code": 7,
    "type": "Course d'endurance",
    "description": "Courses longues visant à tester la résistance et l’endurance des participants."
  },
  {
    "code": 8,
    "type": "Course à étapes",
    "description": "Courses réparties sur plusieurs jours avec différentes étapes."
  },
  {
    "code": 9,
    "type": "Relais marathon",
    "description": "Marathon divisé en segments parcourus par plusieurs coureurs en relais."
  },
  {
    "code": 10,
    "type": "Relais cross",
    "description": "Course en relais sur terrain varié ou cross-country."
  },
  {
    "code": 11,
    "type": "Cross-country",
    "description": "Course sur terrain naturel varié, souvent en campagne ou forêt."
  },
  {
    "code": 12,
    "type": "Sky running",
    "description": "Courses en haute montagne avec dénivelé important et terrain technique."
  },
  {
    "code": 13,
    "type": "Course en montagne",
    "description": "Courses sur sentiers et pistes de montagne, avec forts dénivelés."
  },
  {
    "code": 14,
    "type": "Course dans le désert",
    "description": "Courses organisées sur terrains désertiques, souvent longues et difficiles."
  },
  {
    "code": 15,
    "type": "Course hivernale",
    "description": "Courses sur neige ou en conditions hivernales."
  },
  {
    "code": 16,
    "type": "Course nocturne",
    "description": "Courses se déroulant principalement la nuit."
  },
  {
    "code": 17,
    "type": "Course caritative",
    "description": "Courses organisées pour collecter des fonds pour des causes sociales."
  },
  {
    "code": 18,
    "type": "Course virtuelle",
    "description": "Courses réalisées individuellement avec suivi en ligne, souvent sur route ou trail."
  },
  {
    "code": 19,
    "type": "Color run",
    "description": "Course ludique où les participants sont colorés à différents points du parcours."
  },
  {
    "code": 20,
    "type": "Mud run",
    "description": "Course à obstacles avec boue et terrains difficiles."
  },
  {
    "code": 21,
    "type": "Course éco-responsable",
    "description": "Course organisée en limitant l’impact écologique et en sensibilisant les participants."
  },
  {
    "code": 22,
    "type": "Course d'aventure",
    "description": "Courses mêlant course, orientation et parfois obstacles naturels."
  },
  {
    "code": 23,
    "type": "Trail loisir",
    "description": "Trail court ou modéré destiné aux coureurs amateurs ou loisirs."
  },
  {
    "code": 24,
    "type": "Trail caritatif",
    "description": "Trail organisé pour collecter des fonds pour une cause."
  },
  {
    "code": 25,
    "type": "Course chronométrée longue distance (1h, 12h, 24h)",
    "description": "Courses où l’objectif est de courir la plus grande distance possible sur une durée définie."
  },
  {
    "code": 26,
    "type": "Course nationale",
    "description": "Course reconnue à l’échelle nationale, inscrite au calendrier officiel d’une fédération ou d’une ligue du pays."
  },
  {
    "code": 27,
    "type": "Course internationale",
    "description": "Course ouverte aux participants étrangers et inscrite dans le circuit international, souvent qualificative pour des compétitions mondiales."
  },
  {
    "code": 28,
    "type": "Course marche",
    "description": "Épreuve de marche athlétique ou de marche rapide, respectant les règles techniques propres à la discipline."
  },
  {
    "code": 29,
    "type": "Course en binôme",
    "description": "Course réalisée en duo, où les deux participants doivent parcourir ensemble tout le parcours selon un esprit d’équipe et de coopération."
  },
  {
    "code": 30,
    "type": "Backyard Ultra",
    "description": "Format d’endurance extrême où les participants parcourent une boucle de 6,7 km chaque heure, jusqu’à ce qu’il ne reste qu’un seul coureur. Souvent considéré comme une forme d’ultra-trail à élimination."
  },
  {
    "code": 31,
    "type": "Épreuve de qualification",
    "description": "Course servant de qualification pour un championnat national ou mondial, avec des critères de performance précis."
  },
  {
    "code": 32,
    "type": "Vertical Race",
    "description": "Course en montagne consistant à gravir un fort dénivelé positif sur une courte distance."
  },
  {
    "code": 33,
    "type": "Course combinée",
    "description": "Épreuve combinant plusieurs disciplines ou distances, parfois sur plusieurs jours."
  },
  {
    "code": 34,
    "type": "Course d’orientation",
    "description": "Course où les participants doivent trouver des balises à l’aide d’une carte et d’une boussole."
  },
  {
    "code": 35,
    "type": "Last Man Standing",
    "description": "Format de course à élimination où tous les participants doivent compléter une boucle dans un temps imparti, et seul le dernier coureur encore en course est déclaré vainqueur. Ce format est similaire à la Backyard Ultra."
  },
  {
    "code": 36,
    "type": "UTMB® World Series Event",
    "description": "Événement officiel faisant partie des UTMB® World Series. Les courses permettent de gagner des points ITRA et suivent les standards internationaux en matière de trail running et de sécurité. Destiné aux coureurs expérimentés et semi-professionnels."
  }
]
